nxp-mcuxpresso/mcux-sdk-examples/frdmrw612/driver_examples/lcdic/interrupt/pin_mux.c
/*
 * Copyright 2024 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 0.16.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: E5, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: F12, peripheral: LCDIC, signal: LCD_SPI_DATA, pin_signal: GPIO_46}
  - {pin_num: D14, peripheral: LCDIC, signal: LCD_SPI_SS, pin_signal: GPIO_49}
  - {pin_num: J11, peripheral: LCDIC, signal: LCD_SPI_RESET, pin_signal: GPIO_44}
  - {pin_num: H10, peripheral: LCDIC, signal: LCD_SPI_TE, pin_signal: GPIO_45}
  - {pin_num: E13, peripheral: LCDIC, signal: LCD_SPI_DC, pin_signal: GPIO_47}
  - {pin_num: D13, peripheral: LCDIC, signal: LCD_SPI_SCK, pin_signal: GPIO_48}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24 (pin E5) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    /* Initialize LCD_SPI functionality on pin GPIO_46, GPIO_49, GPIO_44, GPIO_45, GPIO_47, GPIO_48 (pin
     * F12_D14_J11_H10_E13_D13) */
    IO_MUX_SetPinMux(IO_MUX_LCD_SPI);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
